myowndevice/velo/velo/Project/STM8S_StdPeriph_Template/main.c
/**
  ******************************************************************************
  * @file    Project/main.c 
  * @author  MCD Application Team
  * @version V2.2.0
  * @date    30-September-2014
  * @brief   Main program body
   ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "stdio.h"

/* Private defines -----------------------------------------------------------*/

#define PUTCHAR_PROTOTYPE char putchar (char c)
#define GETCHAR_PROTOTYPE char getchar (void)

//#define SIMUL  //для работы в симуляторе

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

//#define BTONLOW 1

#ifdef BTONLOW
//для экономии памяти напишем прямое обращение к регистрам
#define btoff   (GPIOD->ODR |= (uint8_t)0b100) //GPIO_WriteHigh(GPIOD,GPIO_PIN_2)
#define ifbton ((GPIOD->ODR & (uint8_t)0b100)==0) //((GPIO_ReadOutputData(GPIOD) & GPIO_PIN_2)==0)
#define bton    (GPIOD->ODR &= (uint8_t)(~0b100) ) // GPIO_WriteLow(GPIOD,GPIO_PIN_2))
#define btchange (GPIOD->ODR ^= (uint8_t)0b100)//GPIO_WriteReverse(GPIOD,GPIO_PIN_2)

#else

#define bton   (GPIOC->ODR |= (uint8_t)GPIO_PIN_3) //GPIO_WriteHigh(GPIOC,GPIO_PIN_4)
#define ifbton ((GPIOC->ODR & (uint8_t)GPIO_PIN_3)) //((GPIO_ReadOutputData(GPIOD) & GPIO_PIN_2)==0)
#define btoff    (GPIOC->ODR &= (uint8_t)(~GPIO_PIN_3) ) // GPIO_WriteLow(GPIOD,GPIO_PIN_2))
#define btchange (GPIOC->ODR ^= (uint8_t)GPIO_PIN_3)//GPIO_WriteReverse(GPIOD,GPIO_PIN_2)

#endif

//u32      current_millis = 0;
u32  timeblue=0;
u8   timeblueoff=0;
u8   timehalt=0;
u16  timedelay=0;
u8 	 time_errspeed=0;
u8 	 time_errcad=0;
u8 	 timeawu=0;

u8   flagclr=0;
u8   haltstart;
u8   isawu=0;
bool RXready=FALSE;
bool blueen=FALSE;

u8   errspeed=0;//контроль нарушения скорости и каденса
u8   errcad=0;
u32  errspeed32=0;
u32  errcad32=0;

u32  obs[10];//do 40km\h  po 4km\h

bool kn = FALSE;

u32 hall[2];
u32 activetime;
float power;

uint8_t scor1;//скорость по h1 
uint8_t scor2;//скорость по h2
u32 maxspeed;

uint8_t RXbuff[5];
uint8_t RXtek=0;

#define PI 314 //PI

void Delay (u16 nCount);
uint32_t LSIMeasurment(void);

void clearlocal(void)
{
	u8 i;
	for (i=0;i<10;i++) obs[i]=0;
	hall[0]=0;hall[1]=0;
	activetime=0;
	power=0;
	scor1=0;
	scor2=0;
	maxspeed=0;	
}

struct s_param {
	u8 ves;
	u8 dkoles;
	u32 probeg;//пробег в метрах за все время пользования прибором
	u32 power;//потраченные калории за все время пользования прибором
	u8 numpoezdki;//номер последней поездки
	s8 ks;//контроль скорости
	s8 kk;//контроль каденса
	//итого 14байт!
} param;

struct s_poezdka {
	u8 fix;//1- поездка начата и не зафиксирована 2 - поездка зафиксирована
	u32 nump;//номер поездки по порядку
	u32 probeg;//пробег за поездку
	u32 power;//калории за поездку
	u8 obs[10];//время в процентах от активного времени на каждой скорости для экономии места!
	u8 maxspeed;//максимальная скорость в км\ч за время поездки
	u32 activetime;//активное время поездки в сек, когда скорость была больше 4 км\ч
	//итого 28 байта!  получается 5 поездок!!!
} poezdka;

#define NUMBERP 4  //колво поездок в памяти! вместе с параметрами итого 126байт!
#define ADDRP 0x4000+14  //адрес фо флеше когда начинаются поездки
#define NUMBYTEP 28 //колво байт в одной поездке

void playmusic(u8 t)
{
	//return;
	//играем музыку на разные лады..
	if (t==1) 
	{
		//turn on
		BEEP_Init(BEEP_FREQUENCY_1KHZ);
		BEEP_Cmd(ENABLE);
		Delay(100);
		BEEP_Init(BEEP_FREQUENCY_2KHZ);
		Delay(200);
		BEEP_Init(BEEP_FREQUENCY_4KHZ);
		Delay(100);
	}
	
	if (t==2)
	{
		//bluetooth on
		BEEP_Init(BEEP_FREQUENCY_1KHZ);
		BEEP_Cmd(ENABLE);
		Delay(300);
		BEEP_Cmd(DISABLE);
		Delay(300);			
		BEEP_Cmd(ENABLE);
		Delay(300);						
	}
	
	if (t==3)
	{
		//bluetooth off
		BEEP_Init(BEEP_FREQUENCY_4KHZ);		
		BEEP_Cmd(ENABLE);
		Delay(300);
		BEEP_Cmd(DISABLE);
		Delay(300);			
		BEEP_Cmd(ENABLE);
		Delay(300);						
	}		
	
	if (t==4)
	{
		//sleep
		BEEP_Init(BEEP_FREQUENCY_2KHZ);
		BEEP_Cmd(ENABLE);
		Delay(100);
		BEEP_Cmd(DISABLE);
		Delay(100);			
		BEEP_Cmd(ENABLE);
		Delay(100);						
	}	
	
	if (t==5)
	{
		//sleep
		BEEP_Init(BEEP_FREQUENCY_4KHZ);
		BEEP_Cmd(ENABLE);
		Delay(700);
	}	
	
	if (t==6)
	{
		//sleep
		BEEP_Init(BEEP_FREQUENCY_1KHZ);
		BEEP_Cmd(ENABLE);
		Delay(700);
	}	
	BEEP_Cmd(DISABLE);
}

void saveflash(u32 addrf,u32 addr,u8 nbyte)
{
	FLASH_Unlock(FLASH_MEMTYPE_DATA);
	
	while (nbyte--)
	{
		FLASH_ProgramByte(addrf, *((u8 *)addr));
		addr++;
		addrf++;
	}
	
	FLASH_Lock(FLASH_MEMTYPE_DATA);
}

void readflash(u32 addrf,u32 addr,u8 nbyte)
{
	FLASH_Unlock(FLASH_MEMTYPE_DATA);
	
	while (nbyte--)
	{
		*((u8 *)addr) = FLASH_ReadByte(addrf);
		addr++;
		addrf++;
	}
	
	FLASH_Lock(FLASH_MEMTYPE_DATA);
}

void cleareeprom(u8 i)
{
	if (i)
	{
		param.ves = 80;
		param.dkoles = 105;
	}

	param.probeg= 0;
	param.power= 0;		
	param.numpoezdki=0;//текущая поездка куда пишем
	saveflash(0x4000,(u32)&param,14);
	//еще очистить поездки!
	{
		u8 b=0;
		poezdka.nump=0;
		poezdka.fix=0;
		for (b=0;b<NUMBERP;b++)
		{
			saveflash(ADDRP+b*NUMBYTEP,(u32)&poezdka,NUMBYTEP);
		}
	}
	
	
