myowndevice/velo/velo/Project/STM8S_StdPeriph_Template/main.c
}

void nextp(void) {
	param.numpoezdki++;
	
	if (param.numpoezdki >= NUMBERP)
			param.numpoezdki=0;
}		

void printparam(void){
	printf("%i(ves-kg)%i (d-cm)%li (ks)%i (kk)%i (prob)%li (cal)%li\n\r",(int)param.numpoezdki,(int)param.ves,(long)param.dkoles,param.ks,param.kk,param.probeg,param.power);
}	

void main(void)
{
	//BitStatus kn;
	//uint8_t st;
	//uint32_t myclk;
	//int i;
	//char comand;
	
	//CLK->PCKENR1 = 0;
	CLK->PCKENR1 = CLK_PCKENR1_UART1|CLK_PCKENR1_TIM4;
	CLK->PCKENR2 = 0b01110111;
	
	clearlocal();
	
	CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
	
	haltstart=1;
	GPIO_Init(GPIOD,GPIO_PIN_3,GPIO_MODE_IN_PU_IT);//knopka
	GPIO_Init(GPIOC,GPIO_PIN_7,GPIO_MODE_IN_PU_IT);//H1
	GPIO_Init(GPIOC,GPIO_PIN_6,GPIO_MODE_IN_PU_IT);//H2
	
	//прерывания по падающему фронту, напишем напрямую -меньше памяти
	//EXTI_SetExtIntSensitivity(EXTI_PORT_GPIOD,EXTI_SENSITIVITY_FALL_ONLY);
	EXTI->CR1 &= (uint8_t)(~EXTI_CR1_PDIS);
	EXTI->CR1 |= (uint8_t)((uint8_t)(0x02) << 6);
    
	//EXTI_SetExtIntSensitivity(EXTI_PORT_GPIOC,EXTI_SENSITIVITY_FALL_ONLY);
	EXTI->CR1 &= (uint8_t)(~EXTI_CR1_PCIS);
	EXTI->CR1 |= (uint8_t)((uint8_t)(0x02) << 4);
    
	

	BEEP_Cmd(DISABLE);
	
	UART1_DeInit();
  UART1_Init((uint32_t)9600, UART1_WORDLENGTH_8D, UART1_STOPBITS_1, UART1_PARITY_NO,
              UART1_SYNCMODE_CLOCK_DISABLE, UART1_MODE_TXRX_ENABLE);
	
	UART1_ITConfig(UART1_IT_RXNE_OR,ENABLE);

	//миллисекундный таймер
	/* Time base configuration */
	TIM4_TimeBaseInit(TIM4_PRESCALER_64, 124); //надо 57-1!
	//TIM4_TimeBaseInit(TIM4_PRESCALER_64, 124);
	/* Clear TIM4 update flag */
	TIM4_ClearFlag(TIM4_FLAG_UPDATE);
	/* Enable update interrupt */
	TIM4_ITConfig(TIM4_IT_UPDATE, ENABLE);

	/* enable interrupts */
	enableInterrupts();
	
	/* Enable TIM4 */
	TIM4_Cmd(ENABLE);

	Delay(1000);//на всякий случай чтобы было время зайти в режим программирования без ресет
	
	
	//halt();

	
	//для экономии энергии все ноги в LOW или HIZ
	GPIO_Init(GPIOC,GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5,GPIO_MODE_OUT_PP_LOW_SLOW);
	GPIO_Init(GPIOB,GPIO_PIN_5|GPIO_PIN_4,GPIO_MODE_OUT_OD_HIZ_SLOW);
	//energo sber	
	GPIO_Init(GPIOD,GPIO_PIN_4,GPIO_MODE_OUT_PP_LOW_SLOW);//speaker
	GPIO_Init(GPIOC,GPIO_PIN_3,GPIO_MODE_OUT_PP_LOW_SLOW);//blue on off


	//нужно чтобы если сел аккумулятор при включении был минимальный расход энергии
	#ifndef SIMUL
	halt();//do knopki!!!
	#endif
	
	#ifndef SIMUL
	CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO, CLK_SOURCE_HSE, DISABLE, CLK_CURRENTCLOCKSTATE_DISABLE);
	CLK->CKDIVR |= (uint8_t)(0b11); //CLK_SYSCLKConfig(CLK_PRESCALER_CPUDIV8);
	#endif
	
	
	playmusic(1);
	haltstart = 0;

	
	bton;//включаем bluetooth
	blueen = TRUE;
	//сбросим кнопку потому что мы ей могли будить прибор
	kn = FALSE;
	
	timeblueoff = 120;
	timehalt    = 120;
	
	
	//прочитаем параметры поездки
	readflash(0x4000,(u32)&param,14);
	
	if (param.ves==255 || param.ves==0)
	{
		cleareeprom(1);
	}
	
	readflash(ADDRP+param.numpoezdki*NUMBYTEP,(u32)&poezdka,NUMBYTEP);
	if (poezdka.fix==1)
	{
		//закроем прошлую поездку.
		param.power+=poezdka.power;
		param.probeg+=poezdka.probeg;
		nextp();
		saveflash(0x4000,(u32)&param,14);
		//начнем новую поездку
		poezdka.fix = 0;
		poezdka.nump++;
		saveflash(ADDRP+param.numpoezdki*NUMBYTEP,(u32)&poezdka,NUMBYTEP);
		
	}

	/* Infinite loop */
  while (1)
  {
		#ifdef SIMUL
		//в симуляторе не работают прервания, поэтому делаем вид сами
		activetime++;
		//current_millis++;
		obs[activetime%10]++;
		if (current_millis % 50==0){
			if (timehalt) timehalt--;
		}	
		#endif
		
		
		if (timeblue==0 && blueen) {
			//каждые 2 сек будем выводить на экран что то и считать все подряд
			timeblue = 2;
			
			printf("(cad)%i (SCOR)%i (all)%li (ob)%li (prob)%li (cal)%li (atime)%li\n\r",(int)scor1,(int)scor2,(long)(hall[0]+hall[1]),(long)(hall[0]),(long)(hall[1]*(long)param.dkoles*PI/100/100),(long)power,activetime);
			
			printf("t");
			//printf("%i",(int)timehalt);
			{
				u8 j;
				for (j=0;j<10;j++){
					printf(":(%i)%li",(int)(j+1)*4,(long)obs[j]);
				}
				printf("\n\r");
			}
		}	
		
		if (kn==TRUE) {
			//кнопка управляет блютус модулем и выводим из спящего режима
			kn = FALSE;
			btchange;
			
			if (ifbton)
				{
					blueen=TRUE;
					timeblueoff=120;
					playmusic(2);
				}
			else 	
				{
					blueen=FALSE;
					playmusic(3);
				}
		}	
		
		if (timeblueoff==0 && blueen==TRUE && 0)
		{
			//через 2 мин выключаем блютус!
			blueen=FALSE;
			btoff;
			playmusic(3);
		}
		
		if (timehalt==0) {
			flagclr=0;
			haltstart=1;
			timehalt=120;
			btoff;//выкл блютус
			blueen=FALSE;
			
			//пришло время спать запишем данные поездки во флеш на всякий случай!!
			if (activetime>1200) //маленькие поездки не фиксируем!
			{
				u8 u;
				poezdka.activetime = activetime;
				poezdka.power = (u32)power;//оставим целую часть от калорий
				for (u=0;u<10;u++)
				{
					poezdka.obs[u]=0;
					if(obs[u])
						poezdka.obs[u] = obs[u]*100/activetime;//переведем в проценты от общего активного времени!
						
				}
				poezdka.maxspeed = maxspeed;
				poezdka.probeg = (long)hall[1] * param.dkoles * 314 / 10000;
				poezdka.fix = 1;
				
				saveflash(ADDRP+param.numpoezdki*NUMBYTEP,(u32)&poezdka,NUMBYTEP);
				
				//readflash(ADDRP+param.numpoezdki*NUMBYTEP,(u32)&poezdka,NUMBYTEP);
			}
			
			
			playmusic(4);
			
			//на всякий случай включим прерывания! вдруг отключили!
			GPIO_Init(GPIOD,GPIO_PIN_3,GPIO_MODE_IN_PU_IT);//knopka
			GPIO_Init(GPIOC,GPIO_PIN_7,GPIO_MODE_IN_PU_IT);//H1
			GPIO_Init(GPIOC,GPIO_PIN_6,GPIO_MODE_IN_PU_IT);//H2
	
			
			//current_millis=0;

			//переходим на LSI
			CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO, CLK_SOURCE_LSI, DISABLE, CLK_CURRENTCLOCKSTATE_DISABLE);
	
			//калибровку можно не делать - особая точность не нужна
			//AWU_LSICalibrationConfig(LSIMeasurment());
			AWU_Init(AWU_TIMEBASE_30S);

			timeawu=255;//255 * 30 = 7600 сек = 2часа !!!
			
