myowndevice/velo/velo/Project/STM8S_StdPeriph_Template/main.c
			/*
			halt();
			
			while (isawu)
			{
				u8 i=0;
				isawu = i;
				halt();
			}
			*/
			isawu=1;
			
			//halt after interrupt
			//CFG->GCR |= CFG_GCR_AL;
			
			do
			{
				halt();
				_asm("nop");
				_asm("nop");
				//playmusic(5);
			} while (isawu);
			

			//выключаем AWU режим
			isawu=0;
			AWU_DeInit();
			//включаем обратно HSE
			CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO, CLK_SOURCE_HSE, DISABLE, CLK_CURRENTCLOCKSTATE_DISABLE);
			
			haltstart=0;
			
			playmusic(1);

			kn=FALSE;
		}	
		
		if (errspeed > 20 && time_errspeed == 0)
		{
			time_errspeed = 30;
			playmusic(5);
		}
		
		if (errcad > 20 && time_errcad == 0)
		{
			time_errcad= 30;
			playmusic(6);
		}
		

		#ifdef SIMUL
		//для тестирования разбора строки
		RXready = TRUE;
		RXbuff[0]='s';
		RXbuff[1]='-';
		RXbuff[2]='1';
		RXbuff[3]='0';
		RXbuff[4]='6';
		RXtek = 5;
		#endif
		
		if (RXready) {
			//надо обработать команду
			u8 cmd=0;
			u8 start=0;
			s8 znak=1;
			u8* pp;
			
			if (flagclr==1 && RXbuff[0]=='y' && RXbuff[1]=='e' && RXbuff[2]=='s')
			{
				//сотрем все поездки
				cleareeprom(0);
				printf("clear\n\r");//printf("all cleared\n\r");
			}
			flagclr=0;
			
			switch (RXbuff[0]) {
			case 'c':
				flagclr = 1;
				printf("yes?\n\r");
				break;
			case 'i':
				if (RXbuff[1]=='n' && RXbuff[2]=='f' && RXbuff[3]=='o' && RXtek==5) 
				{
					u8 u;
					//выведем инфо о поездках
					printparam();
					
					for (u=0;u<NUMBERP;u++)
					{
						readflash(ADDRP+u*NUMBYTEP,(u32)&poezdka,NUMBYTEP);
						if(poezdka.fix){
							printf("\n\r");
							printf("(num)%li (time)%li (maxs)%li (cal)%li (km)%li\n\r",(long)poezdka.nump,(long)poezdka.activetime/60,(long)poezdka.maxspeed,(long)poezdka.power,(long)poezdka.probeg);
					
							printf("t");
							{
								u8 j;
								for (j=0;j<10;j++)
								{
									printf(":(%i)%i",(int)(j+1)*4,(int)poezdka.obs[j]);
								}
								printf("\n\r");
							}
							printf("\n\r");
						
						}
					}
					timeblue=10;
				}
				break;
			case 'v':
				cmd=3;
				start = 1;
				pp = &param.ves;
				break;
			case 'd':
				cmd=3;
				start = 1;
				pp = &param.dkoles;
				break;
			case 's':
				cmd=3;
				if(RXbuff[1]='-') {
					start=2;
					znak=-1;
				} else start = 1;
				
				pp = (u8 *)&param.ks;
				break;
			case 'k':
				cmd=3;
				if(RXbuff[1]='-') {
					start=2;
					znak=-1;
				} else start = 1;
				
				pp = (u8 *)&param.kk;
				break;
			default:
				break;
			}	
			
			if (cmd) 
			{
				u8 u;
				u8 rez=0;
				u8 r=1;
				u8 noerr=1;
				u8 ind = RXtek-2;
					
				//установка параметров
				for(u=start;u<RXtek-1;u++)
				{
					//v256  start = 2 Rxtek = 5
					if (RXbuff[ind] < 0x30 ||  RXbuff[ind] > 0x39)
					{
						//ошибка тут должно быть только число!
						noerr=0;
						break;
					}
					
					rez = rez + (RXbuff[ind] - 0x30) * r;
					r *= 10;
					ind--;
				}
				if (noerr)
				{
					//установим параметр и выведем сообщение о всех параметрах!
					if (znak>0) *pp = rez;
					else *(s8 *)pp = (s8)rez * (-1);

					saveflash(0x4000,(u32)&param,14);		

					printparam();					
				}
			}
			
			RXtek = 0;
			RXready = FALSE;		
		}	
  }
}

#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
uint32_t LSIMeasurment(void)
{

  uint32_t lsi_freq_hz = 0x0;
  uint32_t fmaster = 0x0;
  uint16_t ICValue1 = 0x0;
  uint16_t ICValue2 = 0x0;

  /* Get master frequency */
  fmaster = CLK_GetClockFreq();

  /* Enable the LSI measurement: LSI clock connected to timer Input Capture 1 */
  AWU->CSR |= AWU_CSR_MSR;

#if defined (STM8S903) || defined (STM8S103) || defined (STM8S003)
  /* Measure the LSI frequency with TIMER Input Capture 1 */
  
  /* Capture only every 8 events!!! */
  /* Enable capture of TI1 */
	TIM1_ICInit(TIM1_CHANNEL_1, TIM1_ICPOLARITY_RISING, TIM1_ICSELECTION_DIRECTTI, TIM1_ICPSC_DIV8, 0);
	
  /* Enable TIM1 */
  TIM1_Cmd(ENABLE);
  
  /* wait a capture on cc1 */
  while((TIM1->SR1 & TIM1_FLAG_CC1) != TIM1_FLAG_CC1);
  /* Get CCR1 value*/
  ICValue1 = TIM1_GetCapture1();
  TIM1_ClearFlag(TIM1_FLAG_CC1);
  
  /* wait a capture on cc1 */
  while((TIM1->SR1 & TIM1_FLAG_CC1) != TIM1_FLAG_CC1);
  /* Get CCR1 value*/
  ICValue2 = TIM1_GetCapture1();
  TIM1_ClearFlag(TIM1_FLAG_CC1);
  
  /* Disable IC1 input capture */
  TIM1->CCER1 &= (uint8_t)(~TIM1_CCER1_CC1E);
  /* Disable timer2 */
  TIM1_Cmd(DISABLE);
  
#else  
  /* Measure the LSI frequency with TIMER Input Capture 1 */
  
  /* Capture only every 8 events!!! */
  /* Enable capture of TI1 */
  TIM3_ICInit(TIM3_CHANNEL_1, TIM3_ICPOLARITY_RISING, TIM3_ICSELECTION_DIRECTTI, TIM3_ICPSC_DIV8, 0);

  /* Enable TIM3 */
  TIM3_Cmd(ENABLE);

	/* wait a capture on cc1 */
  while ((TIM3->SR1 & TIM3_FLAG_CC1) != TIM3_FLAG_CC1);
	/* Get CCR1 value*/
  ICValue1 = TIM3_GetCapture1();
  TIM3_ClearFlag(TIM3_FLAG_CC1);

  /* wait a capture on cc1 */
  while ((TIM3->SR1 & TIM3_FLAG_CC1) != TIM3_FLAG_CC1);
    /* Get CCR1 value*/
  ICValue2 = TIM3_GetCapture1();
	TIM3_ClearFlag(TIM3_FLAG_CC1);

  /* Disable IC1 input capture */
  TIM3->CCER1 &= (uint8_t)(~TIM3_CCER1_CC1E);
  /* Disable timer3 */
  TIM3_Cmd(DISABLE);
#endif

  /* Compute LSI clock frequency */
  lsi_freq_hz = (8 * fmaster) / (ICValue2 - ICValue1);
  
  /* Disable the LSI measurement: LSI clock disconnected from timer Input Capture 1 */
  AWU->CSR &= (uint8_t)(~AWU_CSR_MSR);

 return (lsi_freq_hz);
}

