myowndevice/velo/velo/Project/STM8S_StdPeriph_Template/main.c
void Delay(u16 nCount)
{
    /* Decrement nCount value */
    //uint32_t tm = current_millis+nCount;
		timedelay = nCount;
		
		#ifdef SIMUL
		return;
		#endif

		while (timedelay)
    {
    }
}


PUTCHAR_PROTOTYPE
{
  /* Write a character to the UART1 */
  UART1_SendData8(c);
  /* Loop until the end of transmission */
  while (UART1_GetFlagStatus(UART1_FLAG_TXE) == RESET);

  return (c);
}

GETCHAR_PROTOTYPE
{
#ifdef _COSMIC_
  char c = 0;
#else
  int c = 0;
#endif
   //Loop until the Read data register flag is SET 
  
	//while (UART1_GetFlagStatus(UART1_FLAG_RXNE) == RESET);
  //  c = UART1_ReceiveData8();
  return (c);
}


//-------interrupts

uint32_t nextsec=1000;
uint32_t kntime=0;
uint32_t h1time=0;
uint32_t h2time=0;

uint8_t h1=0;
uint8_t h2=0;


 INTERRUPT_HANDLER(TIM4_UPD_OVF_IRQHandler, 23)
 {
  /* In order to detect unexpected events during development,
     it is recommended to set a breakpoint on the following instruction.
  */
	
	//current_millis++;
	TIM4_ClearITPendingBit(TIM4_IT_UPDATE);
	
	
	{
		//учтем мс временные интервалы и защиту от дребезга
		if (h1time)	
		{
			h1time++;
			if (h1time==30) 
				{
					GPIO_ReadInputPin(GPIOC,GPIO_PIN_7);
					GPIO_Init(GPIOC,GPIO_PIN_7,GPIO_MODE_IN_PU_IT);
				}
		}
		if (h2time)	
		{	
			h2time++;
			if (h2time==30) 
			{
				GPIO_ReadInputPin(GPIOC,GPIO_PIN_6);
				GPIO_Init(GPIOC,GPIO_PIN_6,GPIO_MODE_IN_PU_IT);				
			}
				
		}		
		if (kntime)	
		{	
			kntime--;
			if (kntime==0) 
				GPIO_Init(GPIOD,GPIO_PIN_3,GPIO_MODE_IN_PU_IT);
		}		
		
		if (nextsec)   nextsec--;
		if (timedelay) timedelay--;		
	}
	
	
  if (h2time > 3000) {
		scor2 = 0;
		h2time=0;
	}
	if (h1time > 5000) {
		scor1 = 0;
		h1time=0;
	}
	
	if (nextsec==0) {
		//раз в секунду! обработка того что раз в секунду
		//может быть в общем цикле
		nextsec = 1000;
		
		if (timehalt)		 		timehalt--;
		if (timeblue) 	 		timeblue--;
		if (timeblueoff) 		timeblueoff--;
		if (time_errspeed) 	time_errspeed--;
		if (time_errcad) 		time_errcad--;
		
		//раз в секунду
		if (scor2)
		{
			uint32_t ind = scor2/4;
			if (ind>9) ind=9;
				
			//калории только когда педали крутим!
			if (scor1)
				power += (float)param.ves * (float)scor2 / 3600;
			
			if (scor2 > 3) {
				//едем быстрее 3км\ч
				activetime++;
				obs[ind]++;
				
				if (scor2>maxspeed) maxspeed=scor2;
			}	
			
			//контроль нарушений
			if (param.ks)	{
					errspeed = errspeed - (u8)((errspeed32 & (1L <<31))?1:0);
					errspeed32 <<= 1;
					if ((param.ks > 0) ? (scor2 < (u8)param.ks) : (scor2 > (u8) (-param.ks)) ) {
						errspeed++;//есть нарушение скорости!
						errspeed32 |= 1;
					}
					
			}
			
			if ( param.kk )	{
					errcad= errcad- (u8)(errcad& (1L <<31))?1:0;
					errcad = errcad << 1;
					if ((param.kk > 0) ? (scor2 < (u8)param.kk) : (scor2 > (u8) (-param.kk)) ) {
						errcad++;//есть нарушение скорости!
						errcad |= 1;
					}
			}
		}
	}
 }


INTERRUPT_HANDLER(EXTI_PORTC_IRQHandler, 5)
{
  /* In order to detect unexpected events during development,
     it is recommended to set a breakpoint on the following instruction.
  */
	//main prog after interrupt
	//CFG->GCR &= ~CFG_GCR_AL;
	isawu=0;
	
	if ((BitStatus)(GPIO_ReadInputPin(GPIOC,GPIO_PIN_7)) == RESET) {
			//h1++;
			//защита от дребезга контактов - отключим прервание на 50мс
			if (haltstart==0)
				GPIO_Init(GPIOC,GPIO_PIN_7,GPIO_MODE_IN_PU_NO_IT);
			
			if (h1time>1) {
				scor1 = 60000/(h1time - 1);//в оборотах в мин
			}	else scor1 = 0;
			
			h1time = 1;
			hall[0]++;
			timehalt=120;//сбросим таймер сна
	}
	
	if ((BitStatus)(GPIO_ReadInputPin(GPIOC,GPIO_PIN_6)) == RESET) {
			//h2++;
			//защита от дребезга контактов - отключим прервание на 50мс
			if (haltstart==0)
				GPIO_Init(GPIOC,GPIO_PIN_6,GPIO_MODE_IN_PU_NO_IT);
			
			if (h2time>1) {
				scor2 = (u8)(36*(u32)param.dkoles*314/100/(h2time - 1));//в км/ч
				//1/ms * dkol * 314/10 * 36 / 10
			}	else scor2 = 0;
			
			h2time = 1;
			hall[1]++;
			timehalt=120;//сбросим таймер сна !!!!
	}
}

INTERRUPT_HANDLER(EXTI_PORTD_IRQHandler, 6)
{
  /* In order to detect unexpected events during development,
     it is recommended to set a breakpoint on the following instruction.
  */
	//main prog after interrupt
	//CFG->GCR &= ~CFG_GCR_AL;
	isawu=0;
	
	if ((BitStatus)(GPIO_ReadInputPin(GPIOD,GPIO_PIN_3)) == RESET) {
			//защита от дребезга контактов - отключим прервание на 50мс
			if( haltstart==0) GPIO_Init(GPIOD,GPIO_PIN_3,GPIO_MODE_IN_PU_NO_IT);
			kn = TRUE;
			kntime = 200;
	}		
}

INTERRUPT_HANDLER(AWU_IRQHandler, 1)
{
  /* In order to detect unexpected events during development,
     it is recommended to set a breakpoint on the following instruction.
  */
	//надо просто прочитать регистр чтобы сбросить флаг прерывания
	AWU->CSR;   //AWU_GetFlagStatus();
	//isawu=1;
	
	if (timeawu) 
		timeawu--;
	else {
		//поездка закончилась! надо начать следующую!
		if (poezdka.fix) { //если есть поездка!
			poezdka.fix=2;
			saveflash(ADDRP+param.numpoezdki*NUMBYTEP,(u32)&poezdka,NUMBYTEP);

			nextp();
			param.power += poezdka.power;
			param.probeg += poezdka.probeg;
			saveflash(0x4000,(u32)&param,14);
			
			poezdka.fix = 0;
			poezdka.nump++;
			saveflash(ADDRP+param.numpoezdki*NUMBYTEP,(u32)&poezdka,NUMBYTEP);//первые 5 байт! только 2 переменные
		}
		//обнулим все данные по текущей поездке
		clearlocal();
		
		AWU_DeInit();
	}
}
